learningTest/src/Catalogs/Вопросы/Вопросы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Вопросы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Вопрос</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВариантыОтветов</name>
    <attributes>
      <name>Ответ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Правильный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

learningTest/src/Catalogs/Вопросы/ManagerModule.bsl
Функция ПолучитьСписокВопросов() Экспорт

	//Запрос1 = Новый Запрос;
	//Запрос1.Текст = 
	//	"ВЫБРАТЬ
	//	|	Вопросы.Код КАК Код
	//	|ИЗ
	//	|	Справочник.Вопросы КАК Вопросы
	//	|ГДЕ
	//	|	Вопросы.ЭтоГруппа = ИСТИНА
	//	|	И Вопросы.Родитель.Код = &Код";
	//
	//Запрос1.УстановитьПараметр("Код", ПараметрыСеанса.КодТестирования);
	//
	//РезультатЗапроса = Запрос1.Выполнить();	
	//МассивРазделов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0);	
	
	Запрос2 = Новый Запрос;
	Запрос2.Текст = 
		"ВЫБРАТЬ
		|	Вопросы.Код КАК Код,
		|	Вопросы.Вопрос КАК Вопрос,
		|	Вопросы.ВариантыОтветов.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		Ответ КАК Ответ,
		|		Правильный КАК Правильный
		|	) КАК ВариантыОтветов,
		|	ВЗ.НомерСтроки КАК ПравильныйОтвет
		|ИЗ
		|	Справочник.Вопросы КАК Вопросы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВопросыВариантыОтветов.Ссылка КАК Ссылка,
		|			ВопросыВариантыОтветов.НомерСтроки КАК НомерСтроки
		|		ИЗ
		|			Справочник.Вопросы.ВариантыОтветов КАК ВопросыВариантыОтветов
		|		ГДЕ
		|			ВопросыВариантыОтветов.Правильный = ИСТИНА) КАК ВЗ
		|		ПО Вопросы.Ссылка = ВЗ.Ссылка
		|ГДЕ
		|	Вопросы.ЭтоГруппа = ЛОЖЬ
		|	И Вопросы.Родитель.Код В(&МассивРазделов)"; 
	
	Запрос2.УстановитьПараметр("МассивРазделов", ПараметрыСеанса.КодТестирования);	
	Выборка = Запрос2.Выполнить().Выгрузить();
	ПоследнийИндекс = Выборка.Количество() - 1;    
	
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	ТЗ = НовыйСписокВопросов(Выборка);	 
	
	КостантаКоличествоВопросов = Константы.КоличествоВопросовВТесте.Получить();
	КоличествоВопросов = ?(КостантаКоличествоВопросов<>0,КостантаКоличествоВопросов,ПоследнийИндекс);

	Пока ТЗ.Количество() <> КоличествоВопросов Цикл
		
		ИндексСтр = ГСЧ.СлучайноеЧисло(0, ПоследнийИндекс);
		ВыбранныйВопрос = Выборка[ИндексСтр]; 		
		НайденнаяСтрока = ТЗ.Найти(ВыбранныйВопрос.Код, "Код");
		
		Если НайденнаяСтрока = Неопределено Тогда
			
			СтрокаТЗ = ТЗ.Добавить();
			СтрокаТЗ.Код = ВыбранныйВопрос.Код;
			СтрокаТЗ.Вопрос = ВыбранныйВопрос.Вопрос; 
			СтрокаТЗ.ВариантыОтветов = ВыбранныйВопрос.ВариантыОтветов;
            СтрокаТЗ.ПравильныйОтвет = ВыбранныйВопрос.ПравильныйОтвет; 
			
		КонецЕсли;  
			
	КонецЦикла; 	
	
	Возврат ТЗ; 
	
КонецФункции 

Функция НовыйСписокВопросов(Знач Выборка)
	
	ТЗ = Новый ТаблицаЗначений;
	Для каждого Колонка из Выборка.Колонки Цикл 
		
		ТЗ.Колонки.Добавить(Колонка.Имя);		
		
	КонецЦикла;
	
	Возврат ТЗ;

КонецФункции
